package ec.app.UAR.modal;

import ec.EvolutionState;
import ec.app.UAR.LSDPSBR.Archive;
import ec.app.UAR.repair.RepairEvolutionState;
import ec.util.Parameter;
import java.util.ArrayList;

/**
 * 多任务进化状态
 * 保存需要处理的任务
 * 需要初始化任务列表
 * */

public class ModalEvolutionState extends RepairEvolutionState {

    // 保存需要处理的任务
    final public ArrayList<Task> tasks = Task.initialize_72();
    // 性能边界
    final static public double[] frontier = {12.24312842,  29.57376908,  46.793014  ,  28.01791072,
                                             56.17392335,  80.43198004,  12.24948185,  37.95545614,
                                             64.06858154,  28.06190428,  52.10549644,  80.25113127,
                                             18.05630772,  42.93641682,  63.74312457,  33.14624712,
                                             63.58007384,  93.18852944,  16.99829547,  46.79027411,
                                             79.1387761 ,  32.56234097,  61.00465464,  95.56217515,
                                             23.48156357,  52.90489771,  81.3232058 ,  38.15645163,
                                             72.00091983, 107.66732493,  21.68632841,  56.60412174,
                                             96.34574285,  37.04952735,  70.45714571, 111.87621578,
                                             7.54183811,  15.27494988,  22.25682702,  20.65130553,
                                             32.73012668,  47.69660445,   6.76667608,  17.35005941,
                                             28.61664854,  17.57799401,  28.3067551 ,  39.48761404,
                                             11.13318822,  22.44035728,  31.06530198,  23.19827332,
                                             38.21780275,  53.45794948,   9.81025556,  21.92060965,
                                             35.48725531,  20.16942548,  33.00298036,  46.65606265,
                                             14.58571597,  28.58313912,  40.06252984,  25.96397087,
                                             44.23393354,  60.08759055,  12.9563332 ,  27.12089695,
                                             43.52300967,  23.00968163,  38.1024676 ,  54.48024534};

    // 交叉次数
    final public int[] crossover_num = {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
    // 配对次数
    final public int[] partner_num   = {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
    // 尝试次数
    final public int[] try_num   = {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
    // 被选中的个体数量
    final public int[] parent_num   = {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};


    @Override
    public void setup(final EvolutionState state, final Parameter base) {
        super.setup(state, base);
        // 初始化任务列表
    }

    /** 本函数的功能是获取任务列表*/
    public ArrayList<Task> getTasks() {
        return tasks;
    }

    /** 本函数的功能是获取特定任务的边界*/
    public double getFrontier(Task task) {
        if (tasks.contains(task)) {
            int index = getTasks().indexOf(task);
            return frontier[index];
        }
        else return 999999.9;
    }
}
